{
  "model": "Relativity & Space-Time",
  "slug": "relativity-space-time",
  "url": "https://www.cosmictrex.xyz/models/relativity-space-time",
  "thread": [
    {
      "number": 1,
      "text": "Video call with your friend in Tokyo. You're laughing at something they said five seconds ago.\n\nThey're already responding to something else.\n\nRelativity & Space-Time.\n\nThere's no universal \"now.\" Each observer experiences their own present moment depending on location and speed.",
      "charCount": 280,
      "type": "scenario"
    },
    {
      "number": 2,
      "text": "From Reality Is Not What It Seems by Carlo Rovelli:\n\n\"There is past and future, but the present exists only locally. What is 'now' on Earth happened 15 minutes ago on Mars.\"\n\nThe delay isn't a technical glitch. It's physics.",
      "charCount": 224,
      "type": "quote"
    },
    {
      "number": 3,
      "text": "I read a lot. Wanted to remember what mattered. Built this to help me think clearer. Maybe it helps you.\n\nhttps://www.cosmictrex.xyz/models/relativity-space-time",
      "charCount": 161,
      "type": "invitation"
    },
    {
      "number": 4,
      "text": "Your GPS tells you to turn left. \n\nIt knows where you are within feet. Would be miles off without accounting for satellites experiencing time differently than you.\n\nRelativity & Space-Time.\n\nTime runs at different speeds depending on gravity and velocity...",
      "charCount": 257,
      "type": "scenario"
    },
    {
      "number": 5,
      "text": "From The Frontiers of Knowledge by A. C. Grayling:\n\n\"The laws of physics stay constant, but the speed of light is absolute. Time moves differently for different observers.\"\n\nGPS satellites literally age faster than you do.",
      "charCount": 222,
      "type": "quote"
    },
    {
      "number": 6,
      "text": "Signal gets buried under noise. I enjoy organizing ideas. This is what came out of it.\n\nhttps://www.cosmictrex.xyz/models/relativity-space-time",
      "charCount": 143,
      "type": "invitation"
    },
    {
      "number": 7,
      "text": "Your watch shows 3pm. Your friend's watch across town shows 3pm.\n\nAn astronaut's clock on the space station shows something slightly different. Not broken. Actually different.\n\nRelativity & Space-Time.\n\n..",
      "charCount": 205,
      "type": "scenario"
    },
    {
      "number": 8,
      "text": "From A Brief History of Time by Stephen Hawking:\n\n\"There is no unique absolute time. Each person has their own measure of time depending on where they are and how they're moving.\"\n\nYour clock isn't everyone's clock.",
      "charCount": 215,
      "type": "quote"
    },
    {
      "number": 9,
      "text": "Information overload is real. Spent time filtering what I read. See if any of it resonates.\n\nhttps://www.cosmictrex.xyz/models/relativity-space-time",
      "charCount": 148,
      "type": "invitation"
    }
  ],
  "totalTweets": 9,
  "totalChars": 1855
}