{
  "model": "Variation, Selection, and Heredity",
  "slug": "variation-selection-and-heredity",
  "url": "https://www.cosmictrex.xyz/models/variation-selection-and-heredity",
  "thread": [
    {
      "number": 1,
      "text": "100 people apply for one job opening. The person who gets it has something the others didn't.\n\nNext opening, same thing. Pattern repeats.\n\nVariation, Selection, and Heredity.\n\nCompetition constantly filters for advantages. Those advantages compound over generations.",
      "charCount": 266,
      "type": "scenario"
    },
    {
      "number": 2,
      "text": "From #342 the Lessons of History by Founders:\n\n\"Competition is the first law of biology. Selection is constant, and it drives inequality that grows with the complexity of civilization.\"\n\nMarkets don't care about fairness. They select what works.",
      "charCount": 245,
      "type": "quote"
    },
    {
      "number": 3,
      "text": "We all keep re-learning the same things. I organized them here. Take what's useful.\n\nhttps://www.cosmictrex.xyz/models/variation-selection-and-heredity",
      "charCount": 151,
      "type": "invitation"
    },
    {
      "number": 4,
      "text": "One company dominates the market for years. Looks invincible.\n\nThen something kills it. Makes room for others to grow.\n\nVariation, Selection, and Heredity.\n\nDominant players get culled to maintain diversity. No monopoly lasts forever when selection pressure continues.",
      "charCount": 268,
      "type": "scenario"
    },
    {
      "number": 5,
      "text": "From Thinking in Systems by Donella Meadows:\n\n\"The spruce budworm kills dominant trees to maintain diversity. No single species can monopolize resources forever.\"\n\nMonopolies are temporary. Selection keeps working.",
      "charCount": 214,
      "type": "quote"
    },
    {
      "number": 6,
      "text": "Most content is noise. I like reading. This is my attempt to find signal.\n\nhttps://www.cosmictrex.xyz/models/variation-selection-and-heredity",
      "charCount": 141,
      "type": "invitation"
    },
    {
      "number": 7,
      "text": "Coasted through college. Everything came easy. Felt brilliant.\n\nFirst real job kicks your ass. Suddenly you're learning fast.\n\nVariation, Selection, and Heredity.\n\nDifficult conditions teach lasting lessons because survival demands learning. Easy times breed overconfidence.",
      "charCount": 274,
      "type": "scenario"
    },
    {
      "number": 8,
      "text": "From The Most Important Thing by Howard Marks:\n\n\"Tough times teach valuable lessons that stick. Good times teach only bad lessons. They make success feel easy without the corrective pressure.\"\n\nThe lessons that hurt are the ones that last.",
      "charCount": 239,
      "type": "quote"
    },
    {
      "number": 9,
      "text": "Hard to know what actually matters. I'm trying to figure it out. Maybe you are too.\n\nhttps://www.cosmictrex.xyz/models/variation-selection-and-heredity",
      "charCount": 151,
      "type": "invitation"
    }
  ],
  "totalTweets": 9,
  "totalChars": 1949
}