{
  "model": "Kahneman's 8 Decision-Making Questions",
  "slug": "kahneman-s-8-decision-making-questions",
  "url": "https://www.cosmictrex.xyz/models/kahneman-s-8-decision-making-questions",
  "thread": [
    {
      "number": 1,
      "text": "New job offer. Better pay, different city, means uprooting your whole life.\n\nYou must accept or decline by Friday.\n\nKahneman's 8 Decision-Making Questions.\n\nA systematic framework forces conscious analysis of high-stakes decisions instead of trusting autopilot.",
      "charCount": 261,
      "type": "scenario"
    },
    {
      "number": 2,
      "text": "From Thinking Fast and Slow by Daniel Kahneman:\n\n\"Ask yourself: Is this a decision I should think fast or slow about? Am I too stressed to decide well? What would change my mind?\"\n\nSome decisions deserve the full framework. This is one.",
      "charCount": 236,
      "type": "quote"
    },
    {
      "number": 3,
      "text": "Good ideas get buried fast. I pulled them together here. See what clicks.\n\nhttps://www.cosmictrex.xyz/models/kahneman-s-8-decision-making-questions",
      "charCount": 147,
      "type": "invitation"
    },
    {
      "number": 4,
      "text": "About to propose. Can't undo it once you ask.\n\nChoosing a restaurant for dinner. Easy to try somewhere else next time.\n\nKahneman's 8 Decision-Making Questions.\n\nIrreversible decisions need slow, careful thinking. Reversible ones can move fast without much risk.",
      "charCount": 261,
      "type": "scenario"
    },
    {
      "number": 5,
      "text": "From Super Thinking by Gabriel Weinberg, Lauren McCann:\n\n\"Bezos asks: Is this a one-way door or a two-way door? Irreversible decisions need slow thinking. Reversible ones can move fast.\"\n\nKnow which type of decision you're making.",
      "charCount": 230,
      "type": "quote"
    },
    {
      "number": 6,
      "text": "Couldn't keep track of what I was learning. Built this to fix that. Use what helps.\n\nhttps://www.cosmictrex.xyz/models/kahneman-s-8-decision-making-questions",
      "charCount": 157,
      "type": "invitation"
    },
    {
      "number": 7,
      "text": "Inbox full. 50 decisions to make before lunch.\n\nTreat them all the same and you'll burn out on things that don't matter.\n\nKahneman's 8 Decision-Making Questions.\n\nCategorizing decisions by stakes and reversibility helps you allocate mental energy where it actually counts.",
      "charCount": 272,
      "type": "scenario"
    },
    {
      "number": 8,
      "text": "From The Knowledge Project with Shane Parrish:\n\n\"Exceptional decision makers know which choices are one-way doors and optimize accordingly. They move fast on the reversible stuff.\"\n\nSave your energy for what matters.",
      "charCount": 216,
      "type": "quote"
    },
    {
      "number": 9,
      "text": "Core ideas buried in endless repackaging. Tried to get back to the core. Take what fits.\n\nhttps://www.cosmictrex.xyz/models/kahneman-s-8-decision-making-questions",
      "charCount": 162,
      "type": "invitation"
    }
  ],
  "totalTweets": 9,
  "totalChars": 1942
}